case/outputs_steady/openfoam_cases/section_2_x28p1km/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.0123503;

boundaryField
{
    inlet   { type fixedValue; value uniform 0.0123503; }
    outlet  { type inletOutlet; inletValue uniform 0.0123503; value uniform 0.0123503; }
    walls   { type kqRWallFunction; value uniform 0.0123503; }
}
